fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейОтпуска</name>
      <type>
        <types>DefinedType.ВКМ_Количественный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
//&НаКлиенте
//Процедура ОтпускаСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
//
//	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
//	
//	ТекДанные.ДнейОтпуска =  1 + (НачалоДня(ТекДанные.ДатаОкончания) - НачалоДня(ТекДанные.ДатаНачала)) / (60 * 60 * 24);
//	
//	Таб = Объект.ОтпускаСотрудников.Выгрузить();
//	Таб.Свернуть("Сотрудник", "ДнейОтпуска");
//	Элементы.ФормаКоманда1.Заголовок = Строка(Таб.ДнейОтпуска);
////	Сообщить(ТекДанные.Сотрудник);
//
//КонецПроцедуры

&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	
//	Для Каждого СтрокаТЗ Из Объект.ОтпускаСотрудников Цикл
//		СтрокаТЗ.ДнейВего = 1 + 
//			(НачалоДня(СтрокаТЗ.ДатаОкончания) - НачалоДня(СтрокаТЗ.ДатаНачала)) / (60 * 60 * 24);
//	КонецЦикла;
//
//КонецПроцедуры

//&НаКлиенте
//Процедура ОтпускаСотрудниковПриАктивизацииСтроки(Элемент)
//	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
//	Сообщить(ТекДанные.ДнейВего);
//КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
СчитатьДниОтпуска()
	
КонецПроцедуры

&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииНаСервере(Ссылка)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
		|	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
		|		ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, День)) КАК ДнейВсего
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
//	ОтпускаСотрудниковПриИзмененииНаСервере(Объект.Ссылка);
//	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
//	ТекДанные.ДнейВего = 1 + 
//			(НачалоДня(ТекДанные.ДатаОкончания) - НачалоДня(ТекДанные.ДатаНачала)) / (60 * 60 * 24);
//	Сообщить(ТекДанные.ДнейВего);

	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	ТекДанные.ДнейОтпуска =  1 + (НачалоДня(ТекДанные.ДатаОкончания) - НачалоДня(ТекДанные.ДатаНачала)) / (60 * 60 * 24);
	
//	Элементы.ОтпускаСотрудников.ОтборСтрок
	
//	Таб = ЭтотОбъект.ОтпускаСотрудников.Выгрузить();
//	Таб.Свернуть("Сотрудник", "ДнейОтпуска");
	Сообщить(ТекДанные.ДнейОтпуска);

КонецПроцедуры

&НаКлиенте
Процедура СчитатьДниОтпуска()
	
	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;

    Если ТекДанные = Неопределено Тогда
        Элементы.ОтпускаСотрудников.ОтборСтрок = Неопределено;
    Иначе
        ТекСотрудник = ТекДанные.Сотрудник;
        Элементы.ОтпускаСотрудников.ОтборСтрок = Новый ФиксированнаяСтруктура("Сотрудник", ТекСотрудник);
   КонецЕсли

КонецПроцедуры
